ErpTest/src/Documents/пкОперацииСТехникой/пкОперацииСТехникой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкОперацииСТехникой</name>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийСТехникой</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождения</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСостояниеТехники</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкПоказателиСостоянияТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкПоказателиСостоянияТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкМестонахожденияПультовДляПодъемников/пкМестонахожденияПультовДляПодъемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкМестонахожденияПультовДляПодъемников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусСостоянияПульта</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </resources>
  <dimensions>
    <name>Пульт</name>
    <type>
      <types>CatalogRef.пкПультыДляПодъемников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкВидыОперацийСТехникой/пкВидыОперацийСТехникой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийСТехникой</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/ОбъектыЭксплуатации/ОбъектыЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппаОСМеждународныйУчет</name>
    <type>
      <types>CatalogRef.ГруппыОСМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>DefinedType.ИнвентарныйНомерОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШифрПоЕНАОФ</name>
    <type>
      <types>CatalogRef.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСведений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБытовогоНазначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подкласс</name>
    <type>
      <types>CatalogRef.ПодклассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Расположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РемонтирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплаты</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОС</name>
    <type>
      <types>EnumRef.ГруппыОС</types>
    </type>
  </attributes>
  <attributes>
    <name>АмортизационнаяГруппа</name>
    <type>
      <types>EnumRef.АмортизационныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированоВРеестреСистемыПлатон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>пкМодель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>пкЭтоТехника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>пкТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>пкЭтоСервиснаяТехника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>пкЗапретАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НедвижимоеИмущество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитНедвижимоеИмуществоОбновлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУчетаНаработок</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенныйРесурс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДрагоценныеМатериалы</name>
    <attributes>
      <name>ДрагоценныйМатериал</name>
      <type>
        <types>CatalogRef.ДрагоценныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.РасположениеДрагоценныхКамней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/ChartsOfCharacteristicTypes/пкПоказателиСостоянияТехники/пкПоказателиСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>пкПоказателиСостоянияТехники</name>
  <type>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>String</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Местонахождения</name>
      <description>Местонахождения</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Моточасы</name>
      <description>Моточасы</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ТемператураЗамерзанияОхлаждающейЖидкости</name>
      <description>Температура замерзания ох</description>
      <code>000000004</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/Documents/пкОперацииСТехникой/Forms/ФормаДокумента/Module.bsl
/////////////////////////////////////////////////////////////////////////
// Стандартное (почти)

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
    
    УстановитьВидимость();
    
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
    
    Если Объект.ВидОперации = Перечисления.пкВидыОперацийСТехникой.Поступление Тогда
        
        Элементы.Подразделение.Видимость                   = Истина;
        Элементы.Подразделение.Заголовок                   = "Подразделение";
        Элементы.ПодразделениеТекущее.Видимость            = Ложь;
        
        Элементы.Местонахождения.Видимость                 = Истина;
        Элементы.Местонахождения.Заголовок                 = "Местонахождения";
        Элементы.МестонахожденияТекущее.Видимость          = Ложь;
                
    ИначеЕсли Объект.ВидОперации = Перечисления.пкВидыОперацийСТехникой.Перемещение Тогда
        
        Элементы.Подразделение.Видимость                   = Истина;
        Элементы.Подразделение.Заголовок                   = "Подразделение (получатель)";
        Элементы.ПодразделениеТекущее.Видимость            = Истина;
        
        Элементы.Местонахождения.Видимость                 = Истина;
        Элементы.Местонахождения.Заголовок                 = "Местонахождения (получатель)";
        Элементы.МестонахожденияТекущее.Видимость          = Истина;
                
    Иначе
        
        Элементы.Подразделение.Видимость                   = Ложь;
        Элементы.ПодразделениеТекущее.Видимость            = Истина;
        Элементы.ПодразделениеТекущее.Заголовок            = "Подразделение";
        
        Элементы.Местонахождения.Видимость                 = Ложь;
        Элементы.МестонахожденияТекущее.Видимость          = Истина;
        Элементы.МестонахожденияТекущее.Заголовок          = "Местонахождения";
            
    КонецЕсли;  
    
КонецПроцедуры    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Если Параметры.Свойство("Техника") Тогда
            Объект.Техника = Параметры.Техника;    
        КонецЕсли; 
        
        Объект.Ответственный   = Пользователи.ТекущийПользователь();
        Объект.Подразделение   = Объект.Ответственный.Подразделение;
        Объект.Местонахождения = Объект.Подразделение.пкСкладТехники;
    КонецЕсли;    
    
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
 
    УстановитьВидимость();
    
    ПолучитьДанныеПоТехнике();    
    
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоТехнике()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	МестонахожденияТехники.Значение КАК Местонахождения,
    |	ПодразделениеТехники.Значение КАК Подразделение
    |ИЗ
    |	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&ДатаДокумента, Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения)) КАК МестонахожденияТехники
    |		ПО ОбъектыЭксплуатации.Ссылка = МестонахожденияТехники.Техника
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкСостояниеТехники.СрезПоследних(&ДатаДокумента, Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение)) КАК ПодразделениеТехники
    |		ПО ОбъектыЭксплуатации.Ссылка = ПодразделениеТехники.Техника
    |ГДЕ
    |	ОбъектыЭксплуатации.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", Объект.Техника);
    Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата - 1);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        ПодразделениеТекущее   = Выборка.Подразделение;
        МестонахожденияТекущее = Выборка.Местонахождения;
    КонецЕсли;
    
КонецПроцедуры    

&НаКлиенте
Процедура ТехникаПриИзменении(Элемент)
    
    ПолучитьДанныеПоТехнике();
    
КонецПроцедуры

&НаКлиенте
Процедура ПультДляПодъемникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//СписокПультов = ПолучитьСписокПультовДляМестонахождения(Объект.Местонахождения);
	//
	//ПараметрыВыбора1 = Новый Структура;
	//ФН = Новый НастройкиКомпоновкиДанных;
	//Эл = ФН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//Эл.ПравоеЗначение = СписокПультов;
	//Эл.Использование = Истина;
	//Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ПараметрыВыбора1.Вставить("ФиксированныеНастройки", ФН);
	//
	//ОткрытьФорму("Справочник.пкПультыДляПодъемников.ФормаВыбора", ПараметрыВыбора1, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПультовДляМестонахождения(ДатаДокумента, Местонахождение)
	
	СписокПультов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкМестонахожденияПультовДляПодъемниковСрезПоследних.Пульт,
		|	пкМестонахожденияПультовДляПодъемниковСрезПоследних.Местонахождения
		|ИЗ
		|	РегистрСведений.пкМестонахожденияПультовДляПодъемников.СрезПоследних(&ТеДата, ) КАК пкМестонахожденияПультовДляПодъемниковСрезПоследних
		|ГДЕ
		|	пкМестонахожденияПультовДляПодъемниковСрезПоследних.Местонахождения = &ТекМестонахождение";
	
	Запрос.УстановитьПараметр("ТеДата", ?(ЗначениеЗаполнено(ДатаДокумента), ДатаДокумента, ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекМестонахождение", Местонахождение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПультов.Добавить(ВыборкаДетальныеЗаписи.Пульт);
	КонецЦикла;
	
	Возврат СписокПультов;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидОперации <> Перечисления.пкВидыОперацийСТехникой.Поступление
    	И Объект.ВидОперации <> Перечисления.пкВидыОперацийСТехникой.Перемещение Тогда
		Если ЗначениеЗаполнено(МестонахожденияТекущее) И Объект.Местонахождения <> МестонахожденияТекущее Тогда
			Объект.Местонахождения = МестонахожденияТекущее;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПодразделениеТекущее) И Объект.Подразделение <> ПодразделениеТекущее Тогда
			Объект.Подразделение = ПодразделениеТекущее;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
